[
  {
    "salary": "$15 - $22 an hour",
    "postedAt": "Just posted",
    "externalApplyLink": null,
    "positionName": "Intern",
    "jobType": [
      "Internship"
    ],
    "company": "SiteOne Landscape Supply",
    "location": "Burtonsville, MD 20866",
    "rating": 3.2,
    "reviewsCount": 415,
    "urlInput": null,
    "url": "https://www.indeed.com/viewjob?jk=5e90dc7a307beb93",
    "id": "5e90dc7a307beb93",
    "scrapedAt": "2025-12-27T22:17:56.742Z",
    "postingDateParsed": "2025-12-27T08:12:17.204Z",
    "description": "Company Overview:\n\nSiteOne Landscape Supply is the largest national distributor of landscaping products across the United States and Canada. As a leading supplier of wholesale goods for green industry professionals, we have a long history of serving those who design, build, and maintain outdoor spaces – from lawns and gardens to golf courses, sport fields and more. We pride ourselves on knowing our customers and their business better than anyone else and providing them with a one-stop shop of extensive inventory covering irrigation, lighting, turf and landscape maintenance, hardscapes, nursery, and pest control supplies.\n\nAt SiteOne, we are passionate about delivering an outstanding customer experience and will stop at nothing to help our customers win. We know that our associates are the key to this success, and our commitment to the SiteOne DNA and support for our associates through development programs, benefits, and perks align with our vision to \"Be a Great Place to Work for Our Associates\". We foster a culture of safety, teamwork, and continuous improvement. With over 800 locations and exciting expansion ahead, now is the perfect time to join SiteOne and grow Stronger Together™!\n\nPosition Overview:\n\nSiteOne Landscape Supply offers a progressive style internship program designed to give students hands on experience in all facets of our branch operations. Students will rotate through various roles offered in our branches and be tasked with projects along the way. Students will have exposure working alongside our seasoned leadership to help build our customer relationships and keep the branch running smoothly.\n\nThe expected pay range for this role is $15–$22 per hour. Actual starting pay will depend on factors such as location and experience, and will always meet or exceed applicable state and local minimum wage laws.\n\nKaleigh_Treiber_1 from SiteOne on Vimeo.\n\nIN THIS ROLE YOU WILL:\n\nRespond to customer questions concerning products and service issues\nPrice incoming product and material\nRide along with delivery driver and assist with loading/unloading product\nLearn about inventory spot counts and inventory control\nMaintain the cleanliness of the branch and stocking the work area with all necessary supplies\nRide along with an outside sales rep and assist with maintaining customer relationships\nWork on project assigned by manager and present final to leadership\nSkills We Are Seeking::\nExcellent communication skills\nMust be able to lift 50 pounds consistently\nKnowledge/classroom experience or interest in agronomics, plant sciences/horticulture, hardscape, lighting, irrigation, or agriculture\n\nTHE INFORMATION CONTAINED HEREIN IS NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES AND QUALIFICATIONS REQUIRED OF INDIVIDUALS PERFORMING THE JOB. THE QUALIFICATIONS DETAILED IN THIS JOB DESCRIPTION ARE NOT CONSIDERED THE MINIMUM REQUIREMENTS NECESSARY TO PERFORM THE JOB, BUT RATHER AS GUIDELINES. THEY MAY VARY FROM POSITION TO POSITION.\n\nSiteOne Landscape Supply is strongly committed to providing equal employment opportunities for all associates and all applicants for employment. All employment decisions at SiteOne-including those relating to hiring, promotion, transfers, benefits, compensation, placement, and termination-will be made without regard to race, color, national origin, genetic information, creed, sex, sexual orientation, gender, gender identity, religion, age, veteran status, uniform service, pregnancy, disability, or any other factor protected by applicable law.\n\nThis position requires that candidates be authorized to work in the U.S. We are unable to provide sponsorship.\n\nIf you are ever unsure whether a message is really from SiteOne, here’s how to protect yourself from recruiting scams:\n\nSiteOne will never ask for payment, sensitive personal info, or documents over email, messaging apps., or interviews\nAll SiteOne job openings and updates will be posted on our official careers page: https://careers.siteone.com/\nSiteOne job related emails will be sent with a @siteone.com. All other variations are likely fraudulent.\nYou can always reach our SiteOne team directly at Recruiting@siteone.com to confirm\n\nStarting pay will depend on factors such as location and experience, and will always meet or exceed applicable state and local minimum wage laws.",
    "descriptionHTML": "<div>Company Overview:\n<p>\nSiteOne Landscape Supply is the largest national distributor of landscaping products across the United States and Canada. As a leading supplier of wholesale goods for green industry professionals, we have a long history of serving those who design, build, and maintain outdoor spaces &ndash; from lawns and gardens to golf courses, sport fields and more. We pride ourselves on knowing our customers and their business better than anyone else and providing them with a one-stop shop of extensive inventory covering irrigation, lighting, turf and landscape maintenance, hardscapes, nursery, and pest control supplies.</p><p></p><p><br>\nAt SiteOne, we are passionate about delivering an outstanding customer experience and will stop at nothing to help our customers win. We know that our associates are the key to this success, and our commitment to the SiteOne DNA and support for our associates through development programs, benefits, and perks align with our vision to &quot;Be a Great Place to Work for Our Associates&quot;. We foster a culture of safety, teamwork, and continuous improvement. With over 800 locations and exciting expansion ahead, now is the perfect time to join SiteOne and grow Stronger Together&trade;!</p>\nPosition Overview:\n<div>\nSiteOne Landscape Supply offers a progressive style internship program designed to give students hands on experience in all facets of our branch operations. Students will rotate through various roles offered in our branches and be tasked with projects along the way. Students will have exposure working alongside our seasoned leadership to help build our customer relationships and keep the branch running smoothly.</div><div>\nThe expected pay range for this role is $15&ndash;$22 per hour. Actual starting pay will depend on factors such as location and experience, and will always meet or exceed applicable state and local minimum wage laws.</div><div></div><div><br>\nKaleigh_Treiber_1 from SiteOne on Vimeo.</div><div></div><div><b><br>\nIN THIS ROLE YOU WILL:</b></div><ul><li>\nRespond to customer questions concerning products and service issues</li><li>\nPrice incoming product and material</li><li>\nRide along with delivery driver and assist with loading/unloading product</li><li>\nLearn about inventory spot counts and inventory control\n</li><li>Maintain the cleanliness of the branch and stocking the work area with all necessary supplies</li><li>\nRide along with an outside sales rep and assist with maintaining customer relationships\n</li><li>Work on project assigned by manager and present final to leadership</li></ul>\nSkills We Are Seeking::\n<ul><li>Excellent communication skills</li><li>\nMust be able to lift 50 pounds consistently</li><li>\nKnowledge/classroom experience or interest in agronomics, plant sciences/horticulture, hardscape, lighting, irrigation, or agriculture</li></ul><div></div><div><br>\nTHE INFORMATION CONTAINED HEREIN IS NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES AND QUALIFICATIONS REQUIRED OF INDIVIDUALS PERFORMING THE JOB. THE QUALIFICATIONS DETAILED IN THIS JOB DESCRIPTION ARE NOT CONSIDERED THE MINIMUM REQUIREMENTS NECESSARY TO PERFORM THE JOB, BUT RATHER AS GUIDELINES. THEY MAY VARY FROM POSITION TO POSITION.</div><div></div><div><b><br>\nSiteOne Landscape Supply is strongly committed to providing equal employment opportunities for all associates and all applicants for employment. All employment decisions at SiteOne-including those relating to hiring, promotion, transfers, benefits, compensation, placement, and termination-will be made without regard to race, color, national origin, genetic information, creed, sex, sexual orientation, gender, gender identity, religion, age, veteran status, uniform service, pregnancy, disability, or any other factor protected by applicable law.</b></div><div></div><div><b><br>\nThis position requires that candidates be authorized to work in the U.S. We are unable to provide sponsorship.\n</b></div><div>If you are ever unsure whether a message is really from SiteOne, here&rsquo;s how to protect yourself from recruiting scams:</div><ul><li>\nSiteOne will <b>never</b> ask for payment, sensitive personal info, or documents over email, messaging apps., or interviews</li><li>\nAll SiteOne job openings and updates will be posted on our official careers page: <b>https://careers.siteone.com/</b></li><li>\nSiteOne job related emails will be sent with a @siteone.com. All other variations are likely fraudulent.</li><li>\nYou can always reach our SiteOne team directly at <b>Recruiting@siteone.com</b> to confirm</li></ul><div></div><div><br>\nStarting pay will depend on factors such as location and experience, and will always meet or exceed applicable state and local minimum wage laws.</div></div>",
    "searchInput": {
      "position": "internship student",
      "country": "US"
    },
    "isExpired": false
  },
  {
    "salary": "$17.50 - $22.50 an hour",
    "postedAt": "Just posted",
    "externalApplyLink": "https://www.indeed.com/applystart?jk=229bab52cb43f177&from=mobvj&mvj=1&asub=mob&mobvjtk=1jdgu7jcvk8if802&astse=55e7e2fc644cbc41&assa=7975&params=mobvjtk=1jdgu7jcvk8if802&jk=229bab52cb43f177",
    "positionName": "Intern (Part-Time/Year-Round) - City",
    "jobType": [
      "Part-time"
    ],
    "company": "The City of Oklahoma City",
    "location": "Oklahoma City, OK",
    "rating": 3.8,
    "reviewsCount": 138,
    "urlInput": null,
    "url": "https://www.indeed.com/viewjob?jk=229bab52cb43f177",
    "id": "229bab52cb43f177",
    "scrapedAt": "2025-12-27T22:17:58.403Z",
    "postingDateParsed": "2025-12-27T08:56:05.372Z",
    "description": "PAY\n\nPay Range: 858\n\nHourly Rate: $17.50 - $22.50\n\nThe normal starting pay for this position is the minimum of the pay range listed above. A higher rate of pay may be considered, dependent on the qualifications and experience of the selected applicant.\n\nBACKGROUND CHECK\n\nEmployees assigned to the Airports Department must successfully pass a thorough TSA background check including fingerprinting. Please read the Airports Department Notice of Criminal History Records Check and Criminal History Records Checklist available at the following link: Criminal History Records Checklist\n\nAPPLICATION INFORMATION\n\nThis position requires applicants to be at least 18 years of age at the time of application submission.\nEmployees in part-time/year-round positions may work no more than 29 hours per week.\nWhen completing the application, applicants will be asked to respond to application questions.\nCompletion of the application questions is required.\nApplicant responses to the application questions must specifically answer the questions asked.\nResponses to application questions must be supported by work history/information listed on the application/resume.\nApplicants may upload only two attachments. Attachments may include, but are not limited to a resume, cover letter, transcripts, etc. Applicants may also choose to combine documents into one field for upload.\nApplications may not be reviewed if specific responses to application questions have not been provided.\nEach application submission is reviewed independently.\n\nDEPARTMENTAL INFORMATION\n\nThe City of Oklahoma City Airports Department is offering two internships for Aviation Management students currently enrolled in their third or fourth year. The department prefers students who have had some course study in Airport Management.\n\nQualified candidates must be:\n\nEnrolled as a junior or senior undergraduate student at an accredited four-year college or university, or a master's program student majoring in aviation management, aviation technology, or closely aviation-related program; or\nA recently graduated college student with a major in aviation management, aviation technology, or closely aviation-related program. \"Recently graduated\" means the individual should have attended an accredited four-year college or university, or graduate program, and have graduated from that college or university during the past two years, with a degree in Aviation Management, Aviation Technology, Public Administration, Business, or closely aviation-related program.\nStudents must attach copies of transcripts at the time of application submission. Unofficial copies are acceptable.\n\nJOB SUMMARY\n\nThis part-time position is used for training purposes in the field of public administration and in the specific operation of City departments. The position is responsible for providing standard research and administrative and/or technical support to an assigned City department. Typical duties include: performing a wide variety of administrative, project-related, department-specific, and/or financial assignments to assist a City department or division. This position may also be utilized for students and interns working part-time on special projects while completing advanced degree programs.\n\nPREFERRED QUALIFICATIONS\n\nFamiliarity with the basic principles of airport planning and operations and management.\nFamiliarity with flight operations, regulations and procedures. Possession of a pilot’s certificate is beneficial, but is not required.\nKnowledge of applicable Federal Aviation Regulations, including 14CFR Parts 77, 91 and 139.\nExcellent interpersonal skills, and ability to function in an enjoyable yet high-performing work environment.\nAbility to perform assignments and duties with minimal supervision.\n\nOTHER DETAILS\n\nPay Method: City employees are required to receive pay electronically, either via direct deposit or pay card.\n\nFormer Employees: If this position is open to external applicants and you are a former employee, you must be eligible for rehire. If you are unsure of your rehire status, please contact the Human Resources Department at (405) 297-2530. If your rehire status has been coded “Not Eligible,” “Eligible 3,” or “Conditional,” you will need to request a review of your rehire status through the Human Resources Department’s Employee and Labor Relations Division.\n\nBackground Investigation, Drug Testing, Physical Examination: Upon a conditional offer of employment/acceptance of position, the City of Oklahoma City will conduct a criminal history background check for external applicants. Applicants will be provided contact information for any third-party reporting agencies used to collect background information in connection with conditional offers of employment.\n\nIf the position accepted includes a driver license (commercial or non-commercial) Job Requirement, the City of Oklahoma City will obtain a Motor Vehicle Report for internal and external applicants.\n\nIf the position accepted is safety sensitive and/or a driving position, internal and external applicants will be provided a copy of the City of Oklahoma City's Drug and Alcohol Testing Policy prior to being directed for a drug test. A copy is also available at the links below:\n\nHRB 25-01 Drug and Alcohol Testing Procedure\n\nIf the position accepted is cyber security sensitive, internal and external applicants will be subject to a Criminal Justice Information Services (CJIS) Interstate Identification Index (III) Fingerprint Background check. Additionally, employees in this job classification must complete Level 4 Security Awareness Training and pass an online certification test.\n\nAN EQUAL OPPORTUNITY EMPLOYER\n\nIf you require reasonable accommodation at any time during the hiring process, please notify one of the Human Resources Department Representatives by calling 405-297-2530. The City of Oklahoma City will not discriminate against any applicant or employee because of race, color, religion, sex (including pregnancy, actual or perceived sexual orientation, and gender identity and/or expression), national origin, age, disability (mental or physical) and genetic information (including family medical history).",
    "descriptionHTML": "<div><p><b>PAY\n</b></p><p>Pay Range: 858\n</p><p>Hourly Rate: $17.50 - $22.50\n</p><p>The normal starting pay for this position is the minimum of the pay range listed above. A higher rate of pay may be considered, dependent on the qualifications and experience of the selected applicant.\n</p><p><b>BACKGROUND CHECK\n</b></p><p>Employees assigned to the Airports Department must successfully pass a thorough TSA background check including fingerprinting. Please read the Airports Department Notice of Criminal History Records Check and Criminal History Records Checklist available at the following link: <b>Criminal History Records Checklist\n</b></p><p><b>APPLICATION INFORMATION\n</b></p><ul><li>This position requires applicants to be at least 18 years of age at the time of application submission.\n</li><li>Employees in part-time/year-round positions may work no more than 29 hours per week.\n</li><li>When completing the application, applicants will be asked to respond to application questions.\n</li><li>Completion of the application questions is required.\n</li><li>Applicant responses to the application questions must specifically answer the questions asked.\n</li><li>Responses to application questions must be supported by work history/information listed on the application/resume.\n</li><li>Applicants may upload only two attachments. Attachments may include, but are not limited to a resume, cover letter, transcripts, etc. Applicants may also choose to combine documents into one field for upload.\n</li><li>Applications may not be reviewed if specific responses to application questions have not been provided.\n</li><li>Each application submission is reviewed independently.\n</li></ul><p><b>DEPARTMENTAL INFORMATION\n</b></p><p>The City of Oklahoma City <b>Airports Department </b>is offering two internships for Aviation Management students currently enrolled in their third or fourth year. The department prefers students who have had some course study in Airport Management.\n</p><p>Qualified candidates must be:\n</p><ul><li>Enrolled as a junior or senior undergraduate student at an accredited four-year college or university, or a master's program student majoring in aviation management, aviation technology, or closely aviation-related program; or\n</li><li>A recently graduated college student with a major in aviation management, aviation technology, or closely aviation-related program. &quot;Recently graduated&quot; means the individual should have attended an accredited four-year college or university, or graduate program, and have graduated from that college or university during the past two years, with a degree in Aviation Management, Aviation Technology, Public Administration, Business, or closely aviation-related program.\n</li><li>Students must attach copies of transcripts at the time of application submission. Unofficial copies are acceptable.\n</li></ul><p><b>JOB SUMMARY\n</b></p><p>This part-time position is used for training purposes in the field of public administration and in the specific operation of City departments. The position is responsible for providing standard research and administrative and/or technical support to an assigned City department. Typical duties include: performing a wide variety of administrative, project-related, department-specific, and/or financial assignments to assist a City department or division. This position may also be utilized for students and interns working part-time on special projects while completing advanced degree programs.\n</p><p><b>PREFERRED QUALIFICATIONS\n</b></p><ul><li>Familiarity with the basic principles of airport planning and operations and management.\n</li><li>Familiarity with flight operations, regulations and procedures. Possession of a pilot&rsquo;s certificate is beneficial, but is not required.\n</li><li>Knowledge of applicable Federal Aviation Regulations, including 14CFR Parts 77, 91 and 139.\n</li><li>Excellent interpersonal skills, and ability to function in an enjoyable yet high-performing work environment.\n</li><li>Ability to perform assignments and duties with minimal supervision.\n</li></ul><p><b>OTHER DETAILS\n</b></p><p><b>Pay Method: </b>City employees are required to receive pay electronically, either via direct deposit or pay card.\n</p><p><b>Former Employees: </b>If this position is open to external applicants and you are a former employee, you must be eligible for rehire. If you are unsure of your rehire status, please contact the Human Resources Department at (405) 297-2530. If your rehire status has been coded &ldquo;Not Eligible,&rdquo; &ldquo;Eligible 3,&rdquo; or &ldquo;Conditional,&rdquo; you will need to request a review of your rehire status through the Human Resources Department&rsquo;s Employee and Labor Relations Division.\n</p><p><b>Background Investigation, Drug Testing, Physical Examination: </b>Upon a conditional offer of employment/acceptance of position, the City of Oklahoma City will conduct a criminal history background check for external applicants. Applicants will be provided contact information for any third-party reporting agencies used to collect background information in connection with conditional offers of employment.\n</p><p>If the position accepted includes a driver license (commercial or non-commercial) Job Requirement, the City of Oklahoma City will obtain a Motor Vehicle Report for internal and external applicants.\n</p><p>If the position accepted is safety sensitive and/or a driving position, internal and external applicants will be provided a copy of the City of Oklahoma City's Drug and Alcohol Testing Policy prior to being directed for a drug test. A copy is also available at the links below:\n</p><p><b>HRB 25-01 Drug and Alcohol Testing Procedure\n</b></p><p>If the position accepted is cyber security sensitive, internal and external applicants will be subject to a Criminal Justice Information Services (CJIS) Interstate Identification Index (III) Fingerprint Background check. Additionally, employees in this job classification must complete Level 4 Security Awareness Training and pass an online certification test.\n</p><p><b>AN EQUAL OPPORTUNITY EMPLOYER\n</b></p><p>If you require reasonable accommodation at any time during the hiring process, please notify one of the Human Resources Department Representatives by calling 405-297-2530. The City of Oklahoma City will not discriminate against any applicant or employee because of race, color, religion, sex (including pregnancy, actual or perceived sexual orientation, and gender identity and/or expression), national origin, age, disability (mental or physical) and genetic information (including family medical history).</p></div>",
    "searchInput": {
      "position": "internship student",
      "country": "US"
    },
    "isExpired": false
  },
  {
    "salary": "$20 an hour",
    "postedAt": "Just posted",
    "externalApplyLink": "https://www.indeed.com/applystart?jk=a662fe75836535b9&from=mobvj&mvj=1&asub=mob&mobvjtk=1jdgu7kf1j3io800&astse=46c72183fda35aee&assa=9104&params=mobvjtk=1jdgu7kf1j3io800&jk=a662fe75836535b9",
    "positionName": "Intern",
    "jobType": [
      "Part-time"
    ],
    "company": "Wycliffe Bible Translators",
    "location": "Orlando, FL 32832",
    "rating": 4,
    "reviewsCount": 38,
    "urlInput": null,
    "url": "https://www.indeed.com/viewjob?jk=a662fe75836535b9",
    "id": "a662fe75836535b9",
    "scrapedAt": "2025-12-27T22:17:59.617Z",
    "postingDateParsed": "2025-12-27T10:22:41.146Z",
    "description": "Job Title\n\nIntern\n\nLocation\n\nUSA - Florida - Orlando - Wycliffe USA Headquarters\n\nJob Description Summary\n\nAt Wycliffe Bible Translators, your work is more than just a job. As an Intern, you’ll be responsible for supporting departments across the organization with administrative, operational, and project-related tasks.\n\nYour contributions will help teams maintain smooth workflows, support effective communication, support meaningful research and help staff and partners stay focused on what matters most. In this role, you’ll gain meaningful hands-on experience while actively supporting Wycliffe’s mission to advance Bible translation around the world so people can encounter God through His Word.\n\nYou’ll partner with your assigned department's leadership and other departmental team members to:\n- Support key functions within the workgroup.\n- Strengthen cross-departmental relationships that contribute to Wycliffe USA’s mission, vision, and core values.\n- Participate in team engagements that enhance culture, cohesion, performance and outcomes.\n\nJob Description\n\nOverview of What You Will Gain\n\nAs a Wycliffe USA Intern, you’ll gain hands-on experience as you support day-to-day departmental operations and functions within a global organization. You’ll develop practical skills in administration, communication, coordination and project support while learning how departments and teams collaborate to achieve organizational goals. Throughout your internship, you’ll contribute to meaningful work, build professional confidence and gain valuable experience working in a dynamic mission-driven environment.\n\nResponsibilities\n\nYou’ll make an impact as you:\n\nFaithfully and regularly pray for the ongoing work of Bible translation and for people from around the world to experience transformation.\n\nAct as an organizational representative presenting the global ministry of Wycliffe and encouraging interested individuals, organizations and churches to participate in the work of Bible translation.\n\nLive out the conviction that “work flows through relationship” by passionately “loving God and loving people” through word and deed. Promote team and organizational culture standards, ensuring high customer service standards.\n\nCollaborate on departmental initiatives to provide a best-in-class experience for Wycliffe USA future and existing staff. Assist with cross-functional team responsibilities and tactical team/departmental initiatives.\n\nAssist with administrative tasks such as scheduling, documentation, data entry and file organization.\n\nCommunicate clearly and professionally with team members, management and external partners.\n\nSupport meetings and projects by taking notes, preparing materials, gathering information and following up on action items.\n\nMaintain accurate records in organizational systems.\n\nHelp improve processes by identifying inefficiencies and supporting updates or documentation.\n\nTake initiative, manage multiple tasks and adapt to changing priorities.\n\nUphold Wycliffe’s mission, vision, and values in all interactions, tasks, and responsibilities.\n\nPerform other duties as assigned by the Department Manager.\n\nMinimum Skill Sets\n\nThe requirements listed below represent the knowledge, skill and/or ability necessary to perform each duty satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform the following essential functions:\n\nSpiritual Bona Fide Occupational Qualification (BFOQ): Demonstrates desire and ability to support corporate biblical and religious goals and participate in regular work-related spiritual activities without reservation as evidenced by your active participation and willingness to pray with and for others; be a consistent witness for Jesus Christ, maintaining a courteous, Christ-like attitude in all verbal and written, internal and external professional communications.\n\nRelationship Building: Effective at relationship-building with the ability to partner effectively within the department and with other directors and global teams. Works comfortably in both mono- or cross-cultural situations, winning cooperation through awareness and sensitivity to people's needs.\n\nCustomer Focus: Enthusiastic about providing high-quality customer service. Committed to high-quality work and prompt attention to the delivery of results.\n\nInformation Management and Confidentiality: Handles confidential information responsibly to maintain trust of internal and external customers. Maintains communications and information confidentiality as per applicable laws, ethical guidelines, and instructions.\n\nAttention to Detail: Works in a conscientious, consistent and thorough manner. Demonstrates concern for thoroughness and accuracy, verifying that work has been done according to procedures and standards.\n\nCommunication and Interpersonal Skills: Good verbal and written communication skills with the ability to edit own work for spelling and grammar. Solid interpersonal skills in relating to people at all levels and diverse backgrounds. Ability to participate in meetings.\n\nAdaptability: Adapts to changes in the work environment, including working with diverse individuals or groups. Modifies approach or methods to fit the situation. Remains flexible and composed when facing frequent change, delays or unexpected events.\n\nJob Knowledge: Demonstrates willingness to learn and develop skills in using tools, conducting research, and applying administrative and recruiting best practices relevant to the role.\n\nTechnical Skills:\n\nBasic proficiency in tools such as Google Workspace (Gmail, Calendar, Sheets, Docs, Drive, Slides, etc.), Microsoft Office Suite (Word and Excel).\n\nFamiliarity with email platforms, Slack and video conferencing software such as Zoom.\n\nAbility to conduct internet research and quickly learn new software as needed.\n\nEducation & Experience\n\nCurrently enrolled in or a recent graduate from a college or university program, preferably in business, communications, ministry or a related field.\n\nExperience with administrative, project support, or research tasks; experience in nonprofit or ministry settings is a plus.\n\nFamiliarity with diverse staff types and ministry service is beneficial.\n\nSpiritual and Personal Commitments:\n\nAs a religious organization and employer, Wycliffe is permitted to and does make employment decisions on the basis of religion, biblical standards and our religious beliefs. You’ll be asked to:\n\nDemonstrate a personal commitment to Jesus Christ, as evidenced by your personal testimony.\n\nIdentify with and participate in a church and proactively seek to grow your faith in Christ.\n\nEstablish and maintain a team of prayer partners who will support you in your season of ministry at Wycliffe (minimum 3-5 partners).\n\nActively participate in corporate prayer and devotional times.\n\nMaintain an exemplary standard of biblical ethics, behavior and conduct within Wycliffe and in your public and private life outside of Wycliffe.\n\nAgree to abide by Wycliffe’s ethics, behavior and conduct standards at all times.\n\nDemonstrate Christ-like maturity in all interactions as displayed by good judgment based on biblical values and principles.\n\nActively incorporate your faith in Christ, as well as Wycliffe’s beliefs and core values, in all aspects of your daily work.\n\nGuided by your faith in Christ, demonstrate these core competencies in daily work and interactions:\n\nFaithful in following Christ. (See John 8:31-32, Prov. 3:5-6.) Follow Christ faithfully, allowing Scripture to guide decisions, and continually grow in relationship with God and His people.\n\nIntentional in collaboration with humility. (See 1 Cor. 3:5-9, Col. 3:12.) Collaborate intentionally to accomplish work goals, demonstrating a commitment to cross-departmental, inter-organizational and cross-cultural teamwork.\n\nAgile in learning. (See Prov. 1:5, Phil. 1:9-10.) Demonstrate a dedication to personal and professional growth within a culture that values continuous learning, individually and collectively.\n\nExcellent in stewardship. (See 1 Cor. 4:2, 1 Peter. 4:10.) Participate in God’s work, stewarding His resources responsibly with urgency and excellence.\n\nProactive in discernment. (See John 5:17, 19; Matt. 6:33.) Seek to discern where and how God is at work. Align our efforts with His purposes.\n\nCompensation\n\nThe pay range for this position is $20.00 hourly. The compensation for this position is based upon and considers Wycliffe’s non-profit ministry environment.\n\nAbout Wycliffe Bible Translators\n\nFor over 80 years Wycliffe Bible Translators, Inc. has been committed to ensuring that people “from every nation, tribe, people and language” (Revelation 7:9) have access to God’s Word in a language and format they can clearly understand. We believe that accurate, clear and natural translations of the Bible in accessible formats lead to people entering into life-transforming relationships with God.\n\nWycliffe is a catalyst in the global Bible translation movement, engaging with thousands of partners around the world to collaboratively carry out this work.\n\nWycliffe’s vision is that people from every language will understand the Bible and be transformed. Our mission is to serve with the global body of Christ to advance Bible translation so people can encounter God through His Word.\n\nWycliffe is a distinctly Christian community where you can flourish by using your God-given talents and abilities to serve and support the ministry of Bible translation. Your employment with Wycliffe is not merely a vocation; it is responding and making a commitment to actively participate in what He’s doing around the world. Your faith, prayers, skills and experiences are foundational to contributing and witnessing God’s Word impacting people around the world. This is a once-in-eternity opportunity!\n\nWe believe the Bible is the inspired Word of God and is completely trustworthy, speaking with supreme authority in all matters of belief and practice. Wycliffe’s beliefs and core values can be found here. An exemplary standard of ethics, behavior and conduct that reflects biblical principles are lived-out by all staff. As an active partner in fulfilling the Great Commission, Wycliffe staff embrace and adhere to Wycliffe’s beliefs and core values, all of which are essential to Wycliffe fulfilling its Bible translation mission.\n\nPrayer undergirds Bible translation and is foundational to Wycliffe’s work culture. Our work atmosphere provides numerous opportunities, individually and corporately, to actively live out your faith in Jesus Christ as you work heartily as to the Lord.\n\nCome use your God-given gifts and contribute to what God is doing around the world through Bible translation!",
    "descriptionHTML": "<div></div><div><div>Job Title</div>\nIntern<div></div><div>\nLocation</div>\nUSA - Florida - Orlando - Wycliffe USA Headquarters<div></div><div><br>\nJob Description Summary</div>\nAt Wycliffe Bible Translators, your work is more than just a job. As an Intern, you&rsquo;ll be responsible for supporting departments across the organization with administrative, operational, and project-related tasks.<br>\n<br>\nYour contributions will help teams maintain smooth workflows, support effective communication, support meaningful research and help staff and partners stay focused on what matters most. In this role, you&rsquo;ll gain meaningful hands-on experience while actively supporting Wycliffe&rsquo;s mission to advance Bible translation around the world so people can encounter God through His Word.<br>\n<br>\nYou&rsquo;ll partner with your assigned department's leadership and other departmental team members to:<br>\n<ul><li>Support key functions within the workgroup.</li><li>Strengthen cross-departmental relationships that contribute to Wycliffe USA&rsquo;s mission, vision, and core values.</li><li>Participate in team engagements that enhance culture, cohesion, performance and outcomes.</li></ul><div></div><div>\nJob Description</div><div>\nOverview of What You Will Gain</div><div>\nAs a Wycliffe USA Intern, you&rsquo;ll gain hands-on experience as you support day-to-day departmental operations and functions within a global organization. You&rsquo;ll develop practical skills in administration, communication, coordination and project support while learning how departments and teams collaborate to achieve organizational goals. Throughout your internship, you&rsquo;ll contribute to meaningful work, build professional confidence and gain valuable experience working in a dynamic mission-driven environment.</div><div></div><div>\nResponsibilities</div><div>\nYou&rsquo;ll make an impact as you:</div><ul><li><div>\nFaithfully and regularly pray for the ongoing work of Bible translation and for people from around the world to experience transformation.</div></li><li><div>\nAct as an organizational representative presenting the global ministry of Wycliffe and encouraging interested individuals, organizations and churches to participate in the work of Bible translation.</div></li><li><div>\nLive out the conviction that &ldquo;work flows through relationship&rdquo; by passionately &ldquo;loving God and loving people&rdquo; through word and deed. Promote team and organizational culture standards, ensuring high customer service standards.</div></li><li><div>\nCollaborate on departmental initiatives to provide a best-in-class experience for Wycliffe USA future and existing staff. Assist with cross-functional team responsibilities and tactical team/departmental initiatives.</div></li></ul><ul><li><div>\nAssist with administrative tasks such as scheduling, documentation, data entry and file organization.</div></li><li><div>\nCommunicate clearly and professionally with team members, management and external partners.</div></li><li><div>\nSupport meetings and projects by taking notes, preparing materials, gathering information and following up on action items.</div></li><li><div>\nMaintain accurate records in organizational systems.</div></li><li><div>\nHelp improve processes by identifying inefficiencies and supporting updates or documentation.</div></li><li><div>\nTake initiative, manage multiple tasks and adapt to changing priorities.</div></li><li><div>\nUphold Wycliffe&rsquo;s mission, vision, and values in all interactions, tasks, and responsibilities.</div></li><li><div>\nPerform other duties as assigned by the Department Manager.</div></li></ul><div></div><div>\nMinimum Skill Sets</div><div>\nThe requirements listed below represent the knowledge, skill and/or ability necessary to perform each duty satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform the following essential functions:</div><ul><li><div>\nSpiritual Bona Fide Occupational Qualification (BFOQ): Demonstrates desire and ability to support corporate biblical and religious goals and participate in regular work-related spiritual activities without reservation as evidenced by your active participation and willingness to pray with and for others; be a consistent witness for Jesus Christ, maintaining a courteous, Christ-like attitude in all verbal and written, internal and external professional communications.</div></li><li><div>\nRelationship Building: Effective at relationship-building with the ability to partner effectively within the department and with other directors and global teams. Works comfortably in both mono- or cross-cultural situations, winning cooperation through awareness and sensitivity to people's needs.</div></li><li><div>\nCustomer Focus: Enthusiastic about providing high-quality customer service. Committed to high-quality work and prompt attention to the delivery of results.</div></li><li><div>\nInformation Management and Confidentiality: Handles confidential information responsibly to maintain trust of internal and external customers. Maintains communications and information confidentiality as per applicable laws, ethical guidelines, and instructions.</div></li><li><div>\nAttention to Detail: Works in a conscientious, consistent and thorough manner. Demonstrates concern for thoroughness and accuracy, verifying that work has been done according to procedures and standards.</div></li><li><div>\nCommunication and Interpersonal Skills: Good verbal and written communication skills with the ability to edit own work for spelling and grammar. Solid interpersonal skills in relating to people at all levels and diverse backgrounds. Ability to participate in meetings.</div></li><li><div>\nAdaptability: Adapts to changes in the work environment, including working with diverse individuals or groups. Modifies approach or methods to fit the situation. Remains flexible and composed when facing frequent change, delays or unexpected events.</div></li><li><div>\nJob Knowledge: Demonstrates willingness to learn and develop skills in using tools, conducting research, and applying administrative and recruiting best practices relevant to the role.</div></li><li><div>\nTechnical Skills:</div></li><li><ul><li><div>\nBasic proficiency in tools such as Google Workspace (Gmail, Calendar, Sheets, Docs, Drive, Slides, etc.), Microsoft Office Suite (Word and Excel).</div></li><li><div>\nFamiliarity with email platforms, Slack and video conferencing software such as Zoom.</div></li><li><div>\nAbility to conduct internet research and quickly learn new software as needed.</div></li></ul></li></ul><div></div><div>\nEducation &amp; Experience</div><ul><li><div>\nCurrently enrolled in or a recent graduate from a college or university program, preferably in business, communications, ministry or a related field.</div></li><li><div>\nExperience with administrative, project support, or research tasks; experience in nonprofit or ministry settings is a plus.</div></li><li><div>\nFamiliarity with diverse staff types and ministry service is beneficial.</div></li></ul><div></div><div>\nSpiritual and Personal Commitments:</div><div>\nAs a religious organization and employer, Wycliffe is permitted to and does make employment decisions on the basis of religion, biblical standards and our religious beliefs. You&rsquo;ll be asked to:</div><ul><li><div>\nDemonstrate a personal commitment to Jesus Christ, as evidenced by your personal testimony.</div></li><li><div>\nIdentify with and participate in a church and proactively seek to grow your faith in Christ.</div></li><li><div>\nEstablish and maintain a team of prayer partners who will support you in your season of ministry at Wycliffe (minimum 3-5 partners).</div></li><li><div>\nActively participate in corporate prayer and devotional times.</div></li><li><div>\nMaintain an exemplary standard of biblical ethics, behavior and conduct within Wycliffe and in your public and private life outside of Wycliffe.</div></li><li><div>\nAgree to abide by Wycliffe&rsquo;s ethics, behavior and conduct standards at all times.</div></li><li><div>\nDemonstrate Christ-like maturity in all interactions as displayed by good judgment based on biblical values and principles.</div></li><li><div>\nActively incorporate your faith in Christ, as well as Wycliffe&rsquo;s beliefs and core values, in all aspects of your daily work.</div></li><li><div>\nGuided by your faith in Christ, demonstrate these core competencies in daily work and interactions:</div></li><li><ul><li><div>\nFaithful in following Christ. (See John 8:31-32, Prov. 3:5-6.) Follow Christ faithfully, allowing Scripture to guide decisions, and continually grow in relationship with God and His people.</div></li><li><div>\nIntentional in collaboration with humility. (See 1 Cor. 3:5-9, Col. 3:12.) Collaborate intentionally to accomplish work goals, demonstrating a commitment to cross-departmental, inter-organizational and cross-cultural teamwork.</div></li><li><div>\nAgile in learning. (See Prov. 1:5, Phil. 1:9-10.) Demonstrate a dedication to personal and professional growth within a culture that values continuous learning, individually and collectively.</div></li><li><div>\nExcellent in stewardship. (See 1 Cor. 4:2, 1 Peter. 4:10.) Participate in God&rsquo;s work, stewarding His resources responsibly with urgency and excellence.</div></li><li><div>\nProactive in discernment. (See John 5:17, 19; Matt. 6:33.) Seek to discern where and how God is at work. Align our efforts with His purposes.</div></li></ul></li></ul><div></div><div>\nCompensation</div><div>\nThe pay range for this position is $20.00 hourly. The compensation for this position is based upon and considers Wycliffe&rsquo;s non-profit ministry environment.</div><div></div><div>\nAbout Wycliffe Bible Translators</div><div>\nFor over 80 years Wycliffe Bible Translators, Inc. has been committed to ensuring that people &ldquo;from every nation, tribe, people and language&rdquo; (Revelation 7:9) have access to God&rsquo;s Word in a language and format they can clearly understand. We believe that accurate, clear and natural translations of the Bible in accessible formats lead to people entering into life-transforming relationships with God.</div><div>\nWycliffe is a catalyst in the global Bible translation movement, engaging with thousands of partners around the world to collaboratively carry out this work.</div><div>\nWycliffe&rsquo;s vision is that people from every language will understand the Bible and be transformed. Our mission is to serve with the global body of Christ to advance Bible translation so people can encounter God through His Word.</div><div>\nWycliffe is a distinctly Christian community where you can flourish by using your God-given talents and abilities to serve and support the ministry of Bible translation. Your employment with Wycliffe is not merely a vocation; it is responding and making a commitment to actively participate in what He&rsquo;s doing around the world. Your faith, prayers, skills and experiences are foundational to contributing and witnessing God&rsquo;s Word impacting people around the world. This is a once-in-eternity opportunity!</div><div>\nWe believe the Bible is the inspired Word of God and is completely trustworthy, speaking with supreme authority in all matters of belief and practice. Wycliffe&rsquo;s beliefs and core values can be found <div>here</div>. An exemplary standard of ethics, behavior and conduct that reflects biblical principles are lived-out by all staff. As an active partner in fulfilling the Great Commission, Wycliffe staff embrace and adhere to Wycliffe&rsquo;s beliefs and core values, all of which are essential to Wycliffe fulfilling its Bible translation mission.</div><div>\nPrayer undergirds Bible translation and is foundational to Wycliffe&rsquo;s work culture. Our work atmosphere provides numerous opportunities, individually and corporately, to actively live out your faith in Jesus Christ as you work heartily as to the Lord.</div><div>\nCome use your God-given gifts and contribute to what God is doing around the world through Bible translation!</div></div><div></div>",
    "searchInput": {
      "position": "internship student",
      "country": "US"
    },
    "isExpired": false
  },
  {
    "salary": null,
    "postedAt": "1 day ago",
    "externalApplyLink": null,
    "positionName": "Startup Apprenticeship / Operator Intern",
    "jobType": [
      "Full-time"
    ],
    "company": "Symbri",
    "location": "New Braunfels, TX 78130",
    "rating": 0,
    "reviewsCount": 0,
    "urlInput": null,
    "url": "https://www.indeed.com/viewjob?jk=f276f77eccd1a483",
    "id": "f276f77eccd1a483",
    "scrapedAt": "2025-12-27T22:18:00.294Z",
    "postingDateParsed": "2025-12-26T17:27:10.670Z",
    "description": "I’m looking for someone to work directly with me inside a *fast moving* software startup. If you have seen _The Devil Wears Prada_, it’s that type of opportunity and job.\n\nIf our current team accomplishes what we are trying to accomplish, this will be a *life changing opportunity*.\n\nThis is *not* a normal internship or job, and I expect to fire every candidate that I *try* out. What we are looking for may not even exist.\n\nThis opportunity is for someone in a life position where they can:\n\n* Work very long hours\n* Live on very little money for *12 months*\n* Absorb a *firehose* of real-world business, sales, and startup knowledge\n* Trade short-term comfort for long-term upside\n* Feel smarter and more capable than everyone around them\n* Get bored in jobs easily\n* Have ideas pop into their brain constantly, all day long\n* Be extremely good with computers\n* Not be sensitive\n* Feel like they just need a chance\n\nIn return, I will:\n\n* Teach you everything I know about building businesses, sales, operations, and software startups\n* Give you direct exposure to decisions most people never see until they’re *10–15 years* into a career\n* Put you inside a real startup, not a classroom\n* Permanent position available at the end of the year\n\nThis is a good fit if:\n\n* You want *extreme chaos in 2026*\n* You’re highly motivated, resourceful, and durable under pressure\n* You want to roll the dice on what could be the opportunity of a lifetime\n* You want to cram *10 years’ worth* of busine... (913 Ko restants)"
  }
]